In [2]:
import csv
import os
import pandas as pd

In [3]:
budget = pd.read_csv(r'C:\Users\Tony Duron\Python-Challenge\PyBank\Resources\budget_data.csv')

budget

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [4]:
budget['Date'].count()

86

In [5]:
budget['Profit/Losses'].sum()

38382578

In [6]:
budget['MoM'] = budget['Profit/Losses'].diff()
budget

        Date  Profit/Losses       MoM
0   Jan-2010         867884       NaN
1   Feb-2010         984655  116771.0
2   Mar-2010         322013 -662642.0
3   Apr-2010         -69417 -391430.0
4   May-2010         310503  379920.0
..       ...            ...       ...
81  Oct-2016         102685 -665765.0
82  Nov-2016         795914  693229.0
83  Dec-2016          60988 -734926.0
84  Jan-2017         138230   77242.0
85  Feb-2017         671099  532869.0

[86 rows x 3 columns]

In [7]:
(budget['Profit/Losses'].diff().sum()) / budget['Profit/Losses'].count()

-2288.1976744186045

In [8]:
budget['MoM'].max()

1926159.0

In [9]:
budget['MoM'].min()

-2196167.0

In [10]:
budget = pd.DataFrame(budget.index)

budget

     0
0    0
1    1
2    2
3    3
4    4
..  ..
81  81
82  82
83  83
84  84
85  85

[86 rows x 1 columns]